app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                <%= link_to book_favorites_path(@book),method: :delete do %>
                  ♥<%=@book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
                <%= link_to book_favorites_path(@book),method: :post do %>
                  ♡<%= @book.favorites.count %>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---
          </td>
          <td>コメント数:<%= @book.book_comments.count %></td>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---
          <td>
            <% @book.book_comments.each do |book_comment|%>