app/controllers/users_controller.rb

  def update
    @user=User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "hoge3"], ["profile_image_id", nil], ["updated_at", "2021-12-08 07:31:09.361787"], ["id", 1]]